app/views/favorites/_favorite-btn.html.erb

    <%= link_to book_favorites_path(book), method: :delete, remote: true do %>
      <i class="fa fa-heart liked" ><%= book.favorites.count %></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

    <%= link_to book_favorites_path(book), method: :post, remote: true do %>
      <i class="fa fa-heart" ><%= book.favorites.count %></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]