app/views/books/_index.html.erb

        </td>
        <td>コメント数：<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books" INNER JOIN "favorites" ON "favorites"."book_id" = "books"."id" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "book_id" ORDER BY count(book_id) desc  [["created_at", "2021-05-24 00:00:00"], ["created_at", "2021-05-30 00:00:00"]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]