app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @new_book = Book.new
    @book = Book.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4], ["book_id", 5], ["book_id", 6]]
SELECT "books".* FROM "books" INNER JOIN "favorites" ON "favorites"."book_id" = "books"."id" WHERE "favorites"."created_at" >= ? AND "favorites"."created_at" < ?  [["created_at", "2021-06-05 00:00:00"], ["created_at", "2021-06-11 23:59:59.999999"]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
  def index
    @user = current_user
    # @books = Book.joins(:favorites).where(favorites: {created_at: 0.days.ago.prev_week..0.days.ago.prev_week})
    # @books = Book.find(Favorite.group(:book_id).order('count(book_id) desc').pluck(:book_id))
    to = Time.current.at_end_of_day
    from = (to- 6.day).at_beginning_of_day
    @books = Book.includes(:favorited_users).where(favorites: {created_at: from...to}).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}